app/controllers/posts_controller.rb

INSERT INTO "posts" ("caption", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["caption", "sds"], ["created_at", "2020-07-06 22:46:10.889848"], ["updated_at", "2020-07-06 22:46:10.889848"]]
---
  def create
    @post = Post.create(post_params)